In [1]:
import pandas as pd
technologies={
    'courses':["python","DBMS","Java","python","spark","DBMS","JAVA","DBMS"],
    'fee':[20000,25000,26000,24000,22000,30000,20000,27000],
    'duration':["30days","48days","35days","68days","30days","48days","35days","40days"],
    'discount':[1000,2300,1200,2500,2000,2400,1500,1900]
}
df=pd.DataFrame(technologies )
print(df)

  courses    fee duration  discount
0  python  20000   30days      1000
1    DBMS  25000   48days      2300
2    Java  26000   35days      1200
3  python  24000   68days      2500
4   spark  22000   30days      2000
5    DBMS  30000   48days      2400
6    JAVA  20000   35days      1500
7    DBMS  27000   40days      1900

# usig groupny function in DataFrame to find the first and last element in the group

In [4]:
df.groupby('courses').aggregate({'duration':'count','fee':['first','last']})

        duration    fee
           count  first   last
courses
DBMS           3  25000  27000
JAVA           1  20000  20000
Java           1  26000  26000
python         2  20000  24000
spark          1  22000  22000

In [5]:
df.groupby('courses').aggregate({'fee':'count'})

         fee
courses
DBMS       3
JAVA       1
Java       1
python     2
spark      1